#+TITLE: Functions in R: Practical Tools for Real-World Data
#+DATE: March 12, 2025
#+AUTHOR: Marcus Birkenkrahe (pledged)
#+OPTIONS: toc:nil num:nil
#+STARTUP: overview hideblocks indent entitiespretty:
#+PROPERTY: header-args:R :session *R* :results output :exports both :noweb yes
* Quick Example of Lazy Evaluation

- A function that only calculates a discount if applied:
  #+BEGIN_SRC R
    apply_discount <- function(price, use_discount) {
      if (use_discount) {
        discounted <- price * 0.9  # Only computed if needed
        return(discounted)
      } else {
        return(price)
      }
    }
    apply_discount(100, FALSE)  # 100 (skips discount)
    apply_discount(100, TRUE)   # 90 (calculates discount)
  #+END_SRC

  #+RESULTS:
  : [1] 100
  : [1] 90

- *Lazy Bit*: ~discounted~ isn’t calculated unless ~use_discount~ is ~TRUE~
  —saves effort!

* TODO Practice Exercise: Lazy Evaluation

- Explore lazy evaluation by creating a function that skips
  unnecessary calculations, reinforcing the lecture’s emphasis on
  efficient data processing.

- Scenario: You’re calculating a store’s total sales, but only if a
  manager requests the detailed breakdown. Lazy evaluation ensures the
  breakdown isn’t computed unless needed.

- Starter CodeL: Here’s a function that always calculates everything:
  #+BEGIN_SRC R
    sales_report <- function(sales, detail) {
      total <- sum(sales)
      breakdown <- sales / total  # Always computed
      if (detail) {
        return(breakdown)
      } else {
        return(total)
      }
    }
    daily_sales <- c(10, 20, 30)
    sales_report(daily_sales, FALSE)  # 60, but breakdown still runs
  #+END_SRC

  #+RESULTS:
  : [1] 60

- Modify ~sales_report~ to:
  1. Take ~sales~ (a vector) and ~detail~ (TRUE/FALSE).
  2. Compute ~total~ first.
  3. Only calculate ~breakdown~ if ~detail~ is TRUE, using lazy
     evaluation.
  4. Test with:
     - ~sales_report(daily_sales, FALSE)~ (just total).
     - ~sales_report(daily_sales, TRUE)~ (proportions).

- Hints:
  * Put ~breakdown~ inside an ~if (detail)~ block.
  * R naturally delays evaluating arguments until needed—your
    structure controls this.

- Expected Output:
  * ~sales_report(daily_sales, FALSE)~ → =60= (skips breakdown).
  * ~sales_report(daily_sales, TRUE)~ →
    #+begin_example
    [1] 0.1666667 0.3333333 0.5000000 
    #+end_example
    (proportions: 10/60, 20/60, 30/60).    

* Quick Example of Checking for Missing Arguments

- A function that checks for a missing sales amount:
  #+BEGIN_SRC R
    log_sale <- function(amount) {
      if (missing(amount)) {
        return("No sale amount provided")
      } else {
        return(paste("Sale logged:", amount))
      }
    }
    log_sale()      # "No sale amount provided"
    log_sale(25)    # "Sale logged: 25"
  #+END_SRC

  #+RESULTS:
  : [1] "No sale amount provided"
  : [1] "Sale logged: 25"

- *Key*: ~missing(amount)~ catches the absent input, avoiding an error.

